tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/codec/fsl_wm8962.c
    if (protocol == kWM8962_BusPCMB)
    {
        WM8962_CHECK_RET(
            WM8962_ModifyReg(handle, WM8962_IFACE0, WM8962_IFACE0_FORMAT_MASK, ((uint16_t)protocol | 0x10U)), ret);
    }
    else if (protocol == kWM8962_BusPCMA)
    {
        WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_IFACE0, WM8962_IFACE0_FORMAT_MASK, ((uint16_t)protocol - 1U)),
                         ret);
    }
    else
    {
        WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_IFACE0, WM8962_IFACE0_FORMAT_MASK, (uint16_t)protocol), ret);
    }

    return ret;
}

status_t WM8962_SetModulePower(wm8962_handle_t *handle, wm8962_module_t module, bool isEnabled)
{
    status_t ret = kStatus_Success;
    uint16_t enableValue = isEnabled ? 1U : 0U;  /* Safe bool to uint16_t conversion */

    switch (module)
    {
        case kWM8962_ModuleADC:
            WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_POWER1, WM8962_POWER1_ADCL_MASK,
                                              (enableValue << WM8962_POWER1_ADCL_SHIFT)),
                             ret);
            WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_POWER1, WM8962_POWER1_ADCR_MASK,
                                              (enableValue << WM8962_POWER1_ADCR_SHIFT)),
                             ret);
            break;
        case kWM8962_ModuleDAC:
            WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_POWER2, WM8962_POWER2_DACL_MASK,
                                              (enableValue << WM8962_POWER2_DACL_SHIFT)),
                             ret);
            WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_POWER2, WM8962_POWER2_DACR_MASK,
                                              (enableValue << WM8962_POWER2_DACR_SHIFT)),
                             ret);
            break;
        case kWM8962_ModuleLineIn:
            WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_POWER1, WM8962_POWER1_AINL_MASK,
                                              (enableValue << WM8962_POWER1_AINL_SHIFT)),
                             ret);
            WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_POWER1, WM8962_POWER1_AINR_MASK,
                                              (enableValue << WM8962_POWER1_AINR_SHIFT)),
                             ret);
            break;
        case kWM8962_ModuleHeadphone:
            WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_POWER2, WM8962_POWER2_LOUT1_MASK,
                                              (enableValue << WM8962_POWER2_LOUT1_SHIFT)),
                             ret);
            WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_POWER2, WM8962_POWER2_ROUT1_MASK,
                                              (enableValue << WM8962_POWER2_ROUT1_SHIFT)),
                             ret);
            break;
        case kWM8962_ModuleMICB:
            WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_POWER1, WM8962_POWER1_MICB_MASK,
                                              (enableValue << WM8962_POWER1_MICB_SHIFT)),
                             ret);
            break;
        case kWM8962_ModuleSpeaker:
            WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_POWER2, WM8962_POWER2_SPKL_MASK,
                                              (enableValue << WM8962_POWER2_SPKL_SHIFT)),
                             ret);
            WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_POWER2, WM8962_POWER2_SPKR_MASK,
                                              (enableValue << WM8962_POWER2_SPKR_SHIFT)),
                             ret);
            break;
        default:
            ret = kStatus_InvalidArgument;
            break;
    }

    return ret;
}


status_t WM8962_SetDataRoute(wm8962_handle_t *handle, const wm8962_route_config_t *route)
{
    status_t ret = kStatus_Success;

    /* Input PGA source */
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LEFT_INPUT_PGA, (0x10U | (uint16_t)route->leftInputPGASource)),
                     ret);
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RIGHT_INPUT_PGA, (0x10U | (uint16_t)route->rightInputPGASource)),
                     ret);

    /* Input MIXER source */
    WM8962_CHECK_RET(
        WM8962_WriteReg(handle, WM8962_INPUTMIX,
                        (uint16_t)(((route->leftInputMixerSource & 7U) << 3U) | (route->rightInputMixerSource & 7U))),
        ret);

    /* Output MIXER source */

    if (route->leftSpeakerPGASource == kWM8962_OutputPGASourceMixer)
    {
        WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LEFT_SPEAKER_MIXER, (uint16_t)route->leftSpeakerMixerSource),
                         ret);
    }
    else
    {
        WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LEFT_SPEAKER_MIXER, 0U), ret);
    }

    if (route->rightSpeakerPGASource == kWM8962_OutputPGASourceMixer)
    {
        WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RIGHT_SPEAKER_MIXER, (uint16_t)route->rightSpeakerMixerSource),
                         ret);
    }
    else
    {
        WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RIGHT_SPEAKER_MIXER, 0U), ret);
    }

    if (route->leftHeadphonePGASource == kWM8962_OutputPGASourceMixer)
    {
        WM8962_CHECK_RET(
            WM8962_WriteReg(handle, WM8962_LEFT_HEADPHONE_MIXER, (uint16_t)route->leftHeadphoneMixerSource), ret);
    }
    else
    {
        WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LEFT_HEADPHONE_MIXER, 0U), ret);
    }

    if (route->rightHeadphonePGASource == kWM8962_OutputPGASourceMixer)
    {
        WM8962_CHECK_RET(
            WM8962_WriteReg(handle, WM8962_RIGHT_HEADPHONE_MIXER, (uint16_t)route->rightHeadphoneMixerSource), ret);
    }
    else
    {
        WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RIGHT_HEADPHONE_MIXER, 0U), ret);
    }

    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_INPUT_MIXER_1, 3U), ret);

    return ret;
}

status_t WM8962_SetModuleVolume(wm8962_handle_t *handle, wm8962_module_t module, uint32_t volume)
{
    uint16_t vol = 0;
    status_t ret = kStatus_Success;
    switch (module)
    {
        case kWM8962_ModuleADC:
            if (volume > 255U)
            {
                ret = kStatus_InvalidArgument;
            }
            else
            {
                vol = (uint16_t)volume;
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LADC, vol), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RADC, vol), ret);
                /* Update volume */
                vol = (uint16_t)(0x100U | volume);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LADC, vol), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RADC, vol), ret);
            }
            break;
        case kWM8962_ModuleDAC:
            if (volume > 255U)
            {
                ret = kStatus_InvalidArgument;
            }
            else
            {
                vol = (uint16_t)volume;
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LDAC, vol), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RDAC, vol), ret);
                vol = 0x100U | (uint16_t)volume;
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LDAC, vol), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RDAC, vol), ret);
            }
            break;
        case kWM8962_ModuleHeadphone:
            if (volume > 0x7FU)
            {
                ret = kStatus_InvalidArgument;
            }
            else
            {
                vol = (uint16_t)volume;
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LOUT1, vol), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_ROUT1, vol), ret);
                vol = 0x100U | (uint16_t)volume;
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LOUT1, vol), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_ROUT1, vol), ret);
            }
            break;
        case kWM8962_ModuleLineIn:
            if (volume > 0x3FU)
            {
                ret = kStatus_InvalidArgument;
            }
            else
            {
                vol = (uint16_t)volume;
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LINVOL, vol), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RINVOL, vol), ret);
                vol = 0x100U | (uint16_t)volume;
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LINVOL, vol), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RINVOL, vol), ret);
            }
            break;
        case kWM8962_ModuleSpeaker:
            if (volume > 0x7FU)
            {
                ret = kStatus_InvalidArgument;
            }
            else
            {
                vol = (uint16_t)volume;
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LOUT2, vol), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_ROUT2, vol), ret);
                vol = 0x100U | (uint16_t)volume;
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LOUT2, vol), ret);
                WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_ROUT2, vol), ret);
            }
            break;
        default:
            ret = kStatus_InvalidArgument;
            break;
    }
    return ret;
}

uint32_t WM8962_GetModuleVolume(wm8962_handle_t *handle, wm8962_module_t module)
{
    uint16_t vol = 0;

